applesash/esp-Haier-Controller/apps/testScreen/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP32S3_DATA_CACHE_LINE_SIZE=64
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_TESTSCREEN_LVGL_TASK_CORE=1
CONFIG_TESTSCREEN_LVGL_TASK_PRIORITY=2
CONFIG_TESTSCREEN_LVGL_TASK_STACK_SIZE_KB=8
CONFIG_TESTSCREEN_LVGL_TICK_MS=2
CONFIG_TESTSCREEN_LVGL_BUFFER_HEIGHT=100
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
